/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 80011
Source Host           : localhost:3306
Source Database       : map

Target Server Type    : MYSQL
Target Server Version : 80011
File Encoding         : 65001

Date: 2018-07-27 15:58:51
*/

SET FOREIGN_KEY_CHECKS=0;

create database `map` charset=utf8;

use `map`;

-- ----------------------------
-- Table structure for customer
-- ----------------------------
DROP TABLE IF EXISTS `customer`;
CREATE TABLE `customer` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '用户主键',
  `name` varchar(128) NOT NULL COMMENT '用户主信息',
  `local_position` varchar(256) NOT NULL COMMENT '用户位置',
  `lon` double(10,7) NOT NULL COMMENT '位置经度',
  `lat` double(10,7) NOT NULL COMMENT '位置纬度',
  `geohash` bigint(20) DEFAULT NULL COMMENT 'geohash位置',
  `remarks` varchar(128) DEFAULT NULL COMMENT '备注信息',
  PRIMARY KEY (`id`),
  KEY `idx_lon_lat` (`lon`,`lat`),
  KEY `idx_geohash` (`geohash`)
) ENGINE=InnoDB AUTO_INCREMENT=94 DEFAULT CHARSET=utf8 COMMENT='用户位置信息表';

-- ----------------------------
-- Records of customer
-- ----------------------------
INSERT INTO `customer` VALUES ('1', 'center1', '云南省昆明市盘龙区东风广场', '102.7196620', '25.0381070', null, '以此为中心抓取5km内高德上肯德基数据');
INSERT INTO `customer` VALUES ('2', '肯德基(青年路店)', '云南省昆明市五华区人民中路17号百盛购物广场1层', '102.7154920', '25.0416750', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('3', '肯德基(柏联店)', '云南省昆明市五华区三市街6号柏联广场F2层', '102.7106800', '25.0347830', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('4', '肯德基(正义路店)', '云南省昆明市五华区人民中路61号1层', '102.7094750', '25.0416720', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('5', '肯德基(顺城店)', '云南省昆明市五华区东风西路11号顺城购物中心1F层E1-19', '102.7079330', '25.0352520', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('6', '肯德基(华洲大酒店北店)', '云南省昆明市盘龙区人民东路289号附5号', '102.7324980', '25.0434910', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('7', '肯德基(东寺街店)', '云南省昆明市西山区东寺街东方广场A座1-2层', '102.7095680', '25.0287780', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('8', '肯德基(益龙万象城店)', '云南省昆明市盘龙区环城东路与白龙路交叉口益龙万象城1楼', '102.7310050', '25.0470310', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('9', '肯德基(美辰店)', '云南省昆明市五华区富春街98号美辰百货F1层', '102.7027320', '25.0433630', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('10', '肯德基(小西门店)', '云南省昆明市五华区小西门大观商业城1层', '102.6975250', '25.0431630', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('11', '肯德基(新迎店)', '云南省昆明市盘龙区新迎路212号沃尔玛1楼', '102.7379130', '25.0523990', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('12', '肯德基(海埂路店)', '云南省昆明市西山区海埂路199号臻万百货', '102.7080890', '25.0183170', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('13', '肯德基(新闻路店)', '云南省昆明市五华区新闻路337-339号1层', '102.6944720', '25.0354630', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('14', '肯德基(圆通北路店)', '云南省昆明市五华区圆通北路127号佰腾数码广场昆明店B座1层', '102.7058960', '25.0574540', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('15', '肯德基(云山路店)', '云南省西山区云山路与二环西路交叉口', '102.6704410', '25.0386290', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('16', '肯德基(北辰店)', '云南省昆明市盘龙区北辰大道2-4号', '102.7336190', '25.0806900', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('17', '肯德基(中央商业广场)', '云南省昆明市西山区滇池路569号中央商业广场F2层', '102.6839910', '25.0096900', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('18', '肯德基(万达广场)', '云南省昆明市西山区前兴路688号万达广场西山店2层2027', '102.7103500', '25.0070200', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('19', '肯德基(龙泉店)', '云南省昆明市五华区龙泉路35-37号', '102.7093120', '25.0675430', null, '以center1为中心抓取');
INSERT INTO `customer` VALUES ('20', 'center2', '云南省昆明市五华区云南省第一人名医院', '102.7071830', '25.0330300', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('21', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('22', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('23', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('24', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('25', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('26', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('27', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('28', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('29', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('30', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('31', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('32', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('33', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('34', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('35', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('36', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('37', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('38', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('39', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('40', '中国石化加油站(宝海路)', '云南省昆明市官渡区宝海路148号与双桥路向北路西', '102.7362300', '25.0071350', null, '中心范围10km搜索加油站');
INSERT INTO `customer` VALUES ('41', 'center3', '云南省昆明市翠湖公园', '102.7039220', '25.0487380', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('42', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('43', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('44', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('45', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('46', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('47', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('48', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('49', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('50', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('51', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('52', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('53', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('54', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('55', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('56', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('57', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('58', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('59', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('60', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('61', '首汽租车(学府路店)', '云南省昆明市五华区学府路万科学府3-6栋11号', '102.6901470', '25.0638190', null, '中心范围10km搜索汽车租赁');
INSERT INTO `customer` VALUES ('62', 'center4', '云南省昆明市北辰地铁站', '102.7324390', '25.0811200', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('63', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('64', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('65', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('66', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('67', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('68', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('69', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('70', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('71', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('72', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('73', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('74', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('75', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('76', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('77', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('78', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('79', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('80', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('81', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('82', '北辰财富中心-D1幢A座', '云南省昆明市盘龙区北辰北路与北辰西路交叉口西南100米', '102.7351370', '25.0822610', null, '中心范围10km搜索商务住宅');
INSERT INTO `customer` VALUES ('83', 'center5', '随机位', '100.2844830', '25.6815340', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('84', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('85', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('86', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('87', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('88', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('89', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('90', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('91', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('92', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
INSERT INTO `customer` VALUES ('93', '东岸和园', '云南省大理白族自治州大理市上和线', '100.3129560', '25.6775100', null, '中心范围20km搜索商务住宅');
